# Запрос значения ИМТ у пользователя
v = float(input("Введите индекс массы тела (ИМТ): "))

# Интерпретация результата в соответствии с рекомендациями ВОЗ
if v < 16:
    i = "выраженный дефицит массы тела"
elif 16 <= v < 18.5:
    i = "недостаточная масса тела"
elif 18.5 <= v < 25:
    i = "норма"
elif 25 <= v < 30:
    i = "избыточная масса тела"
elif 30 <= v < 35:
    i = "ожирение первой степени"
elif 35 <= v < 40:
    i = "ожирение второй степени"
else:
    i = "ожирение третьей степени"
print("Интерпретация ВОЗ: ",i)
