n=input("Здравствуйте! Как Вас зовут? ")
print("Очень приятно,", n ,"! Меня зовут Марк.")
a=int(input("Сколько Вам лет? "))
if a==78:
    print("Мы одного возраста!")
elif a>78:
    print("Да,", n ,", Вы старше меня на", a-78 ,"лет.")
else:
    print("Да,",n,", я старше Вас на",78-a," лет.")
s=input("Вам нравится программировать? ")
if s=="да":
    print("Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.")
else:
    print("Жаль. Я думал, Вы сможете написать интересную программу для меня.")
    