s0=input("Собака короткошерстной породы? ")
if s0=="да":
    s1=input("Рост собаки менее 50 см? ")
    if s1=="да":
        s2=input("У собаки короткий хвост? ")
        if s2=="да":
            print("английский бульдог")
        else:
            s3=input("У собаки длинные уши? ")
            if s3=="да":
                print("гончая")
            else:
                s4=input("У собаки короткое тело? ")
                if s4=="да":
                    print("мопс")
                else:
                    print("чихуахуа")
    else:
        s2=input("Собака весит более 50 кг? ")
        if s2=="да":
            print("датский дог")
        else:
            print("фоксхаунд")
else:
    s1=input("Рост собаки менее 50 см? ")
    if s1=="да":
        s2=input("У собаки доброжелательный харакктер? ")
        if s2=="да":
            print("кокер-спаниэль")
        else:
            print("ирландский сеттер")
    else:
        s2=input("У собаки рост менее 70 см? ")
        if s2=="да":
            s3=input("У собаки длинные уши? ")
            if s3=="да":
                print("большой вандейский грифон")
            else:
                print("колли")
        else:
            s3=input("Окрас рыжий с белыми отметинами? ")
            if s3=="да":
                print("сенбернар")
            else:
                s4=input("Белоснежный окрас? ")
                if s4=="да":
                    print("ирландский волкодав")
                else:
                    print("ньюфаундленд")